Revit 2024 API
WorksetKindFilter Class
 A filter used to match worksets of the given WorksetKind.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class WorksetKindFilter : WorksetFilter
Visual Basic
Public Class WorksetKindFilter _
	Inherits WorksetFilter
Visual C++
public ref class WorksetKindFilter : public WorksetFilter
Remarks
 This filter is a quick filter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetFilter
 Autodesk.Revit.DB.WorksetKindFilter
See Also
WorksetKindFilter Members
Autodesk.Revit.DB Namespace